# OwnerId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Sketch..::..OwnerId Property
Sketch Class See Also
---
Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId OwnerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OwnerId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
```

# See Also
Sketch Class
Autodesk.Revit.DB Namespace